Documents/ВыдачаПропуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыдачаПропуска</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПропуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаПропуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПропуск</Name>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимноеПомещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаПропуска/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаполнитьДанныеИзЗаявкиНаСервере();
	ОбновитьОтображениеДанных();
	Элементы.Инициатор.Обновить();
	Элементы.ФизическоеЛицо.Обновить();
	Элементы.ТипПропуска.Обновить();
	Элементы.ЗонаДоступа.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ОбновитьОтображениеДанных();
    Элементы.Инициатор.Обновить();
    Элементы.ФизическоеЛицо.Обновить();
    Элементы.ТипПропуска.Обновить();
    Элементы.ЗонаДоступа.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзЗаявкиНаСервере()
	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПропуск.Инициатор КАК Инициатор,
		|	ЗаявкаНаПропуск.Посетитель КАК Посетитель,
		|	ЗаявкаНаПропуск.ТипПропуска КАК ТипПропуска,
		|	ЗаявкаНаПропуск.ЗонаДоступа КАК ЗонаДоступа
		|ИЗ
		|	Документ.ЗаявкаНаПропуск КАК ЗаявкаНаПропуск
		|ГДЕ
		|	ЗаявкаНаПропуск.Ссылка = &Заявка";
		Запрос.УстановитьПараметр("Заявка", Объект.Заявка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Сообщить("Данные из заявки перед заполнением:");
			Сообщить("  Инициатор: " + ?(ЗначениеЗаполнено(Выборка.Инициатор), Выборка.Инициатор, "Пусто"));
			Сообщить("  Посетитель: " + ?(ЗначениеЗаполнено(Выборка.Посетитель), Выборка.Посетитель, "Пусто"));
			Сообщить("  ТипПропуска: " + ?(ЗначениеЗаполнено(Выборка.ТипПропуска), Выборка.ТипПропуска, "Пусто"));
			Сообщить("  ЗонаДоступа: " + ?(ЗначениеЗаполнено(Выборка.ЗонаДоступа), Выборка.ЗонаДоступа, "Пусто"));
			
			Объект.Ответственный = Выборка.Инициатор;
			Объект.Посетитель = Выборка.Посетитель;
			Объект.ТипПропуска = Выборка.ТипПропуска;
			
			// Обработка ЗоныДоступа как табличной части
			Если ТипЗнч(Объект.ЗоныДоступа) = Тип("ДанныеФормыКоллекция") Тогда
				Объект.ЗоныДоступа.Очистить();
				Если ЗначениеЗаполнено(Выборка.ЗонаДоступа) Тогда
					НоваяСтрока = Объект.ЗоныДоступа.Добавить();
					НоваяСтрока.ЗонаДоступа = Выборка.ЗонаДоступа; // Предполагаем, что колонка называется ЗонаДоступа
				КонецЕсли;
			Иначе
				Объект.ЗоныДоступа = Выборка.ЗонаДоступа;
			КонецЕсли;
			
			Сообщить("Заполнение данных из заявки " + Объект.Заявка + " в форме:");
			Сообщить("  Ответственный (Инициатор): " + ?(ЗначениеЗаполнено(Объект.Заявка.Инициатор), Объект.Заявка.Инициатор, "Не заполнено"));
			Сообщить("  Посетитель: " + ?(ЗначениеЗаполнено(Объект.Заявка.ФизическоеЛицо), Объект.Посетитель, "Не заполнено"));
			Сообщить("  ТипПропуска: " + ?(ЗначениеЗаполнено(Объект.Заявка.ТипПропуска), Объект.ТипПропуска, "Не заполнено"));
			Сообщить("  ЗоныДоступа: " + ?(ЗначениеЗаполнено(Объект.Заявка.ЗонаДоступа), Объект.ЗоныДоступа, "Не заполнено"));
		Иначе
			Сообщить("Не удалось получить данные из заявки " + Объект.Заявка + ". Проверьте корректность ссылки.");
		КонецЕсли;
	Иначе
		Объект.Заявка.Инициатор = Справочники.Сотрудники.ПустаяСсылка();
		Объект.Заявка.ФизическоеЛицо = Справочники.Посетители.ПустаяСсылка();
		Объект.Заявка.ТипПропуска = Справочники.ТипыПропусков.ПустаяСсылка();
		Объект.Заявка.ЗонаДоступа = Выборка.ЗонаДоступа;
		Сообщить("Заявка не заполнена!");
	КонецЕсли;
КонецПроцедуры
